jack77er/openUTRUSTA/Packages/.cache/Keil.LPC1800_DFP.2.5.0.pdsc
<?xml version="1.0" encoding="UTF-8"?>

  <package schemaVersion="1.3" xmlns:xs="http://www.w3.org/2001/XMLSchema-instance" xs:noNamespaceSchemaLocation="PACK.xsd">
    <vendor>Keil</vendor>
    <url>http://www.keil.com/pack/</url>
    <name>LPC1800_DFP</name>
    <description>NXP LPC1800 Series Device Support, Drivers and Examples</description>

    <releases>
      <release version="2.5.0" date="2015-06-19">
        Updated CMSIS drivers:
        - I2C, MCI, EMAC, I2S, SPI, USART, USB Device, USB Host: Updated initialization, uninitialization and power procedures
        - I2S, SPI, USART, USB Device, USB Host: Corrected status bit-field race conditions
        - MCI:
        -- Interrupt processing optimized
        -- Data timeout handling corrected
        Updated example fo USB device VirtualCOM
      </release>
      <release version="2.4.0" date="2015-04-24">
        Device support:
        - added LPC18Sxx series devices
        - updated device features
        Updated CMSIS Driver:
        - I2S: improved fs divider calculation
        - MCI: avoid DMA buffer alignment issues
        - USART:
        -- corrected disabling of receive DMA channel when aborting Receive or Transfer
        -- moved fract_div_lookup_table from header file to driver .c file
        Updated Example for USB Device Mass Storage
      </release>
      <release version="2.3.0" date="2015-03-20">
        Required PACKs: ARM.CMSIS.4.3.0.pack, Keil.MDK-Middleware.6.3.0.pack, Keil.ARM_Compiler.1.0.0.pack
        Updated device support files:
         - LPC18xx.h (added  FLASHCFGA, FLASHCFGB register)
        Updated drivers:
         - RTE_Device.h (driver configuration):
         -- corrected RTE_USB1_IND0_PIN_EN into RTE_USB1_IND1_PIN_EN
         -- removed RTE_USB_USB0_DEV_EP and RTE_USB_USB1_DEV_EP
         - EMAC: corrected return value of PHY_Read and PHY_Write functions
         - MCI: enabled High speed capability and added block size handling
         - SSP: corrected pin handling, ssp->info->mode handling
         - USART: improved baudrate calculation
         - USB Device:
         -- corrected isochronous endpoint configuration
         -- corrected transfer procedure
         -- corrected CLK_M4_USB1_CFG into CLK_M4_USB0_CFG in USBD_PowerControl function
        Added:
         - I2S driver
         - USB Device Audio example
         - Audio Board interface for MCB1800 Evaluation Board
        Updated examples:
         - Compiler I/O software component is now used for I/O retargeting
      </release>
      <release version="2.2.0" date="2014-12-11">
        Updated for use with MDK-Middleware Version 6.2:
        - File_Demo and USB Host MassStorage examples due to new fdelete() API in File System 6.2
        - emWin GUIDemo example (corrected JOYSTICK orientation)
        Corrected:
        - USBD0 driver corrected PORTSC1_D_PFSC into USB_PORTSC1_D_PFSC
        - SCU driver SCU_SFSCLKx(clk_pin) and SCU_ENAIOx(n) macros
        - USART driver modem lines handling
        - SPI0/1 driver avoid stack corruption
        - GPDMA driver initialization and uninitialization is done from drivers
        - ETH driver implemented GetMacAddress function
        Updated SVD file.
      </release>
      <release version="2.1.0" date="2014-07-15">
        Corrected Touch calibration in GUIDemo example (for use with Keil.MDK-Middleware.6.1.0)
        Corrected conditions for SPI drivers and ARM Compiler toolchain dependency
        Updated USB Device drivers
        Updated Flash Programming Algorithm
      </release>
      <release version="2.0.0" date="2014-06-12">
        CMSIS Driver V2 compliant drivers (requires ARM.CMSIS.4.1.0)
        - I2C, MCI, SSP, USART, USB Host and Device, Ethernet MAC
        Examples for MCB1800 Evaluation Board (requires Keil.MDK-Middleware.6.0.0)
        - USB, Network, Graphics and Filesystem
        Board Support Interface drivers
        - ADC, Buttons, Joystick, Graphic LCD, Touchscreen, EEPROM, Thermometer
      </release>
      <release version="1.0.6">
        Renamed subFamilies to 185x for example.
      </release>
      <release version="1.0.5">
        Updated device description with features, added MCB1800 Board description
      </release>
      <release version="1.0.4">
        Updated I2C driver
        USB Device drivers re-implemented
      </release>
      <release version="1.0.3">
        Updated devices list
      </release>
      <release version="1.0.2">
        Updated drivers (namespace prefix ARM_ added)
      </release>
      <release version="1.0.1">
        Synchronized Middleware examples to Keil Middleware version 5.0.1
        Minor Changes
      </release>
      <release version="1.0.0">
        Beta version of LPC1800 Device Family Pack.
      </release>
    </releases>

    <keywords>
      <!-- keywords for indexing -->
      <keyword>NXP</keyword>
      <keyword>Device Support</keyword>
      <keyword>Device Family Package NXP</keyword>
      <keyword>LPC1800</keyword>
      <keyword>LPC18xx</keyword>
    </keywords>

  <devices>
    <family Dfamily="LPC1800 Series" Dvendor="NXP:11">
      <processor Dcore="Cortex-M3" DcoreVersion="r2p1" Dfpu="0" Dmpu="1" Dendian="Little-endian" Dclock="180000000"/>
      <book    name="Documents/dui0552a_cortex_m3_dgug.pdf"           title="Cortex-M3 Generic User Guide"/>
      <description>
NXP LPC1800 devices are high-speed and offer extensive communication peripherals.
Typical applications include Industrial, RFID readers, Consumer, e-Metering and White goods.

  - Three PLLs
  - Quad SPI Flash interface (SPIFI)
  - State Configurable Timer (SCT)
  - LCD Controller (1024x768) for STN and TFT
  - Motor control PWM for three-phase motor
  - Unique ID for each device
      </description>
      
      <feature type="USART"         n="4"/>
      <feature type="I2C"           n="2"/>
      <feature type="SPI"           n="2"/>
      <feature type="Timer"         n="4"       m="32"/>
      <feature type="ADC"           n="8"       m="10"/>
      <feature type="CAN"           n="2"/>

      <!-- ************************  Subfamily 'LPC181x'  **************************** -->
      <subFamily DsubFamily="LPC181x">

        <!-- *************************  Device 'LPC1810'  ***************************** -->
        <device Dname="LPC1810">
          <compile header="Device\Include\LPC18xx.h"  define="LPC18xx"/>
          <debug      svd="SVD\LPC18xx.svd"/>
          <memory     id="IRAM1"                      start="0x10000000"  size="0x10000"    init   ="0"   default="1"/>
          <memory     id="IRAM2"                      start="0x20000000"  size="0x4000"     init   ="0"   default="0"/>
          <book       name="Documents/UM10430.pdf"                          title="LPC1800 Series Reference Manual"/>
          <book       name="Documents/LPC1850_30_20_10.pdf"                 title="LPC1800 Series Datasheet"/>
          <book       name="Documents/ES_LPC18X0.pdf"                       title="LPC1800 Series Erratasheet"/>
          <feature type="PWM"           n="6"/>
        </device>
  
