jack77er/openUTRUSTA/Packages/.cache/Keil.LPC1800_DFP.2.5.0.pdsc
        <!-- *************************  Device 'LPC1812'  ***************************** -->
        <device Dname="LPC1812">
          <compile header="Device\Include\LPC18xx.h"  define="LPC18xx"/>
          <debug      svd="SVD\LPC18xx.svd"/>
          <memory     id="IROM1"                      start="0x1A000000"  size="0x80000"    startup="1"   default="1"/>
          <memory     id="IRAM1"                      start="0x10000000"  size="0x8000"     init   ="0"   default="1"/>
          <memory     id="IRAM2"                      start="0x20000000"  size="0x4000"     init   ="0"   default="0"/>
          <algorithm  name="Flash/LPC18xx43xx_512_BA.FLM" start="0x1A000000" size="0x80000"  RAMstart="0x10000000"  RAMsize="0x0FE0"  default="1"/>
          <book       name="Documents/UM10430.pdf"                          title="LPC1800 Series Reference Manual"/>
          <book       name="Documents/LPC1850_30_20_10.pdf"                 title="LPC1800 Series Datasheet"/>
          <book       name="Documents/ES_LPC18X0.pdf"                       title="LPC1800 Series Erratasheet"/>
          <feature type="PWM"           n="6"/>
          <environment name="uv">
            <postBuild1>$K/ARM/BIN/ElfDwT.exe !L BASEADDRESS(0x1A000000)</postBuild1>
            <postRun1> 1 </postRun1>
          </environment>
        </device>

        <!-- *************************  Device 'LPC1813'  ***************************** -->
        <device Dname="LPC1813">
          <compile header="Device\Include\LPC18xx.h"  define="LPC18xx"/>
          <debug      svd="SVD\LPC18xx.svd"/>
          <memory     id="IROM1"                      start="0x1A000000"  size="0x40000"    startup="1"   default="1"/>
          <memory     id="IROM2"                      start="0x1B000000"  size="0x40000"    startup="0"   default="0"/>
          <memory     id="IRAM1"                      start="0x10000000"  size="0x8000"     init   ="0"   default="1"/>
          <memory     id="IRAM2"                      start="0x20000000"  size="0x4000"     init   ="0"   default="0"/>
          <algorithm  name="Flash/LPC18xx43xx_256_BA.FLM" start="0x1A000000" size="0x40000"  RAMstart="0x10000000"  RAMsize="0x0FE0"  default="1"/>
          <algorithm  name="Flash/LPC18xx43xx_256_BB.FLM" start="0x1B000000" size="0x40000"  RAMstart="0x10000000"  RAMsize="0x0FE0"  default="1"/>
          <book       name="Documents/UM10430.pdf"                          title="LPC1800 Series Reference Manual"/>
          <book       name="Documents/LPC1850_30_20_10.pdf"                 title="LPC1800 Series Datasheet"/>
          <book       name="Documents/ES_LPC18X0.pdf"                       title="LPC1800 Series Erratasheet"/>
          <feature type="PWM"           n="6"/>
          <environment name="uv">
            <postBuild1>$K/ARM/BIN/ElfDwT.exe !L BASEADDRESS(0x1A000000)</postBuild1>
            <postRun1> 1 </postRun1>
          </environment>
        </device>
  
        <!-- *************************  Device 'LPC1815'  ***************************** -->
        <device Dname="LPC1815">
          <compile header="Device\Include\LPC18xx.h"  define="LPC18xx"/>
          <debug      svd="SVD\LPC18xx.svd"/>
          <memory     id="IROM1"                      start="0x1A000000"  size="0x60000"    startup="1"   default="1"/>
          <memory     id="IROM2"                      start="0x1B000000"  size="0x60000"    startup="0"   default="0"/>
          <memory     id="IRAM1"                      start="0x10000000"  size="0x8000"     init   ="0"   default="1"/>
          <memory     id="IRAM2"                      start="0x20000000"  size="0x10000"    init   ="0"   default="0"/>
          <algorithm  name="Flash/LPC18xx43xx_384_BA.FLM" start="0x1A000000" size="0x60000"  RAMstart="0x10000000"  RAMsize="0x0FE0"  default="1"/>
          <algorithm  name="Flash/LPC18xx43xx_384_BB.FLM" start="0x1B000000" size="0x60000"  RAMstart="0x10000000"  RAMsize="0x0FE0"  default="1"/>
          <book       name="Documents/UM10430.pdf"                          title="LPC1800 Series Reference Manual"/>
          <book       name="Documents/LPC1850_30_20_10.pdf"                 title="LPC1800 Series Datasheet"/>
          <book       name="Documents/ES_LPC18X0.pdf"                       title="LPC1800 Series Erratasheet"/>
          <feature type="PWM"           n="6"/>
          <environment name="uv">
            <postBuild1>$K/ARM/BIN/ElfDwT.exe !L BASEADDRESS(0x1A000000)</postBuild1>
            <postRun1> 1 </postRun1>
          </environment>
        </device>
  
        <!-- *************************  Device 'LPC1817'  ***************************** -->
        <device Dname="LPC1817">
          <compile header="Device\Include\LPC18xx.h"  define="LPC18xx"/>
          <debug      svd="SVD\LPC18xx.svd"/>
          <memory     id="IROM1"                      start="0x1A000000"  size="0x80000"    startup="1"   default="1"/>
          <memory     id="IROM2"                      start="0x1B000000"  size="0x80000"    startup="0"   default="0"/>
          <memory     id="IRAM1"                      start="0x10000000"  size="0x8000"     init   ="0"   default="1"/>
          <memory     id="IRAM2"                      start="0x20000000"  size="0x10000"    init   ="0"   default="0"/>
          <algorithm  name="Flash/LPC18xx43xx_512_BA.FLM" start="0x1A000000" size="0x80000"  RAMstart="0x10000000"  RAMsize="0x0FE0"  default="1"/>
          <algorithm  name="Flash/LPC18xx43xx_512_BB.FLM" start="0x1B000000" size="0x80000"  RAMstart="0x10000000"  RAMsize="0x0FE0"  default="1"/>
          <book       name="Documents/UM10430.pdf"                          title="LPC1800 Series Reference Manual"/>
          <book       name="Documents/LPC1850_30_20_10.pdf"                 title="LPC1800 Series Datasheet"/>
          <book       name="Documents/ES_LPC18X0.pdf"                       title="LPC1800 Series Erratasheet"/>
          <environment name="uv">
            <postBuild1>$K/ARM/BIN/ElfDwT.exe !L BASEADDRESS(0x1A000000)</postBuild1>
            <postRun1> 1 </postRun1>
          </environment>
        </device>
      </subFamily>

      <!-- ************************  Subfamily 'LPC182x'  **************************** -->
      <subFamily DsubFamily="LPC182x">
        <feature type="PWM"           n="6"/>
        <feature type="USBD"          n="1"/>

