jack77er/openUTRUSTA/Packages/.cache/Keil.LPC1800_DFP.2.5.0.pdsc
        <!-- *************************  Device 'LPC18S37'  ***************************** -->
        <device Dname="LPC18S37">
          <compile header="Device\Include\LPC18xx.h"  define="LPC18xx"/>
          <debug svd="SVD\LPC18xx.svd"/>
          <memory id="IROM1"                             start="0x1A000000" size="0x80000"    startup="1"   default="1"/>
          <memory id="IROM2"                             start="0x1B000000" size="0x80000"    startup="0"   default="0"/>
          <memory id="IRAM1"                             start="0x10000000" size="0x8000"     init   ="0"   default="1"/>
          <memory id="IRAM2"                             start="0x20000000" size="0x10000"    init   ="0"   default="0"/>
          <algorithm name="Flash/LPC18xx43xx_512_BA.FLM" start="0x1A000000" size="0x80000"  RAMstart="0x10000000"  RAMsize="0x0FE0"  default="1"/>
          <algorithm name="Flash/LPC18xx43xx_512_BB.FLM" start="0x1B000000" size="0x80000"  RAMstart="0x10000000"  RAMsize="0x0FE0"  default="1"/>

          <book name="Documents/UM10430.pdf"        title="LPC18xx Reference Manual"/>
          <book name="Documents/LPC18S5X_S3X.pdf"   title="LPC18S5x/S3x Series Datasheet"/>

          <environment name="uv">
            <postBuild1>$K/ARM/BIN/ElfDwT.exe !L BASEADDRESS(0x1A000000)</postBuild1>
            <postRun1> 1 </postRun1>
          </environment>
        </device>
      </subFamily>

      <!-- ************************  Subfamily 'LPC18S5x'  **************************** -->
      <subFamily DsubFamily="LPC18S5x">
        <feature type="PWM"           n="6"/>
        <feature type="ETH"      n="1"       m="100000000"/>
        <feature type="USBD"          n="2"/>
        <feature type="LCD"           n="1"/>
        <feature type="Crypto"        n="128"                      name="AES engine for encryption and decryption"/>

        <!-- *************************  Device 'LPC18S50'  ***************************** -->
        <device Dname="LPC18S50">
          <compile header="Device\Include\LPC18xx.h"  define="LPC18xx"/>
          <debug svd="SVD\LPC18xx.svd"/>
          <memory id="IRAM1"                             start="0x10000000" size="0x18000"    init   ="0"   default="1"/>
          <memory id="IRAM2"                             start="0x20000000" size="0x10000"    init   ="0"   default="0"/>

          <book name="Documents/UM10430.pdf"        title="LPC18xx Reference Manual"/>
          <book name="Documents/LPC18S50_30_10.pdf" title="LPC18S50/S30/S10 Datasheet"/>
        </device>
  
        <!-- *************************  Device 'LPC18S57'  ***************************** -->
        <device Dname="LPC18S57">
          <compile header="Device\Include\LPC18xx.h"  define="LPC18xx"/>
          <debug svd="SVD\LPC18xx.svd"/>
          <memory id="IROM1"                             start="0x1A000000" size="0x80000"    startup="1"   default="1"/>
          <memory id="IROM2"                             start="0x1B000000" size="0x80000"    startup="0"   default="0"/>
          <memory id="IRAM1"                             start="0x10000000" size="0x8000"     init   ="0"   default="1"/>
          <memory id="IRAM2"                             start="0x20000000" size="0x10000"    init   ="0"   default="0"/>
          <algorithm name="Flash/LPC18xx43xx_512_BA.FLM" start="0x1A000000" size="0x80000"  RAMstart="0x10000000"  RAMsize="0x0FE0"  default="1"/>
          <algorithm name="Flash/LPC18xx43xx_512_BB.FLM" start="0x1B000000" size="0x80000"  RAMstart="0x10000000"  RAMsize="0x0FE0"  default="1"/>

          <book name="Documents/UM10430.pdf"        title="LPC18xx Reference Manual"/>
          <book name="Documents/LPC18S5X_S3X.pdf"   title="LPC18S5x/S3x Series Datasheet"/>

          <environment name="uv">
            <postBuild1>$K/ARM/BIN/ElfDwT.exe !L BASEADDRESS(0x1A000000)</postBuild1>
            <postRun1> 1 </postRun1>
          </environment>
        </device>
      </subFamily>

    </family>
  </devices>

  <boards>
    <board vendor="Keil" name="MCB1800" revision="Ver 1.3" salesContact="sales.intl@keil.com" orderForm="http://www.keil.com/product/prices.asp?MCB1800=ON">
      <description>Keil MCB1800 Development Board</description>
      <image small="Images/mcb1800_small.jpg" large="Images/mcb1800_large.jpg"/>
      <book category="overview"  name="http://www.keil.com/mcb1800/" title="MCB1800 Evaluation Board Web Page"/>
      <book category="schematic" name="Documents/MCB1800v1-3-schematics.pdf" title="MCB1800 Schematics"/>
      <book category="manual"    name="Documents/mcb1800.chm" title="User Manual"/>
      <mountedDevice    deviceIndex="0" Dvendor="NXP:11" Dname="LPC1850"/>
      <mountedDevice    deviceIndex="0" Dvendor="NXP:11" Dname="LPC1857"/>
      <compatibleDevice deviceIndex="0" Dvendor="NXP:11" DsubFamily="LPC185x"/>
      <feature type="XTAL"            n="12000000"/>
      <feature type="PWR"             n="5"              name="USB Powered"/>
      <feature type="PWR"             n="8" m="12"       name="External Power Supply"/>
      <feature type="RAM"             n="1"              name="16 MB SDRAM"/>
      <feature type="ROM"             n="1"              name="16 MB NOR Flash"/>
      <feature type="ROM"             n="1"              name="4 MB Quad-SPI Flash"/>
      <feature type="MemCard"         n="1"              name="microSD Card Holder"/>
      <feature type="Proto"           n="2"              name="Prototyping areas connected to I/Os"/>
      <feature type="USB"             n="1"              name="USB 2.0 High-speed Host/Device/OTG interface (USB host + Micro USB Device/OTG connectors)"/>
      <feature type="USB"             n="1"              name="USB 2.0 Full-speed Host/Device interface (USB host + micro USB Device connectors)"/>
      <feature type="CAN"             n="1"/>
      <feature type="RS232"           n="1"/>
      <feature type="ETH"             n="1"              name="10/100 Ethernet Port"/>
      <feature type="GLCD"            n="1"  m="240.320" name="2.4 inch Color QVGA TFT LCD with resistive touchscreen"/>
      <feature type="Poti"            n="1"              name="Potentiometer for ADC Input"/>
      <feature type="LineIn"          n="2"              name="Audio CODEC with Line-In/Out and Speaker/Microphone"/>
      <feature type="LineOut"         n="2"              name="Audio CODEC with Line-In/Out and Speaker/Microphone"/>
      <feature type="Button"          n="6"              name="Push-Buttons: 3 x GPIO, Reset, ISP, WAKEUP"/>
      <feature type="LED"             n="8"              name="I/O Port LEDs"/>
      <feature type="CustomFF"        n="124" m="170"/>
      <debugInterface adapter="JTAG/SW" connector="20 pin JTAG (0.1 inch connector)"/>
      <debugInterface adapter="JTAG/SW" connector="10 pin Cortex debug (0.05 inch connector)"/>
      <debugInterface adapter="JTAG/SW" connector="20-pin Cortex debug + ETM Trace (0.05 inch connector)"/>
    </board>
  </boards>

  <conditions>
    <!-- conditions are dependency rules that can apply to a component or an individual file -->

    <condition id="LPC1800">
      <!-- conditions selecting Devices -->
      <description>NXP LPC1800 Series devices</description>
      <accept Dvendor="NXP:11" Dname="LPC18??"/>
      <accept Dvendor="NXP:11" Dname="LPC18S??"/>
    </condition>

    <condition id="LPC1800 CMSIS">
      <description>NXP LPC1800 Series devices and CMSIS-CORE and ARMCC compiler</description>
      <require condition="LPC1800"/>
      <require Cclass="CMSIS" Cgroup="CORE"/>
    </condition>

    <condition id="ARM Compiler">
      <require Tcompiler="ARMCC"/>
    </condition>

    <condition id="LPC1800 CMSIS SCU">
      <description>NXP LPC1800 with CMSIS and SCU</description>
      <require condition="LPC1800 CMSIS"/>
      <require Cclass="Device" Cgroup="SCU"/>
    </condition>

