jack77er/openUTRUSTA/Packages/.cache/Keil.LPC1800_DFP.2.5.0.pdsc
    <component Cclass="CMSIS Driver" Cgroup="SPI" Csub="SSP" Capiversion="2.1" Cversion="2.5" condition="LPC1800 CMSIS SCU GPIO GPDMA">
      <description>SPI (SSP) Driver for LPC1800 Series</description>
      <RTE_Components_h>  <!-- the following content goes into file 'RTE_Components.h' -->
        #define RTE_Drivers_SPI0                /* Driver SPI0 */
        #define RTE_Drivers_SPI1                /* Driver SPI1 */
      </RTE_Components_h>
      <files>
        <file category="source" name="RTE_Driver/SSP_LPC18xx.c"/>
      </files>
    </component>

    <component Cclass="CMSIS Driver" Cgroup="USART" Capiversion="2.1" Cversion="2.7" condition="LPC1800 CMSIS SCU GPDMA">
      <description>USART Driver for LPC1800 Series</description>
      <RTE_Components_h>  <!-- the following content goes into file 'RTE_Components.h' -->
        #define RTE_Drivers_USART0              /* Driver USART0 */
        #define RTE_Drivers_USART1              /* Driver USART1 */
        #define RTE_Drivers_USART2              /* Driver USART2 */
        #define RTE_Drivers_USART3              /* Driver USART3 */
      </RTE_Components_h>
      <files>
        <file category="source" name="RTE_Driver/USART_LPC18xx.c"/>
      </files>
    </component>

    <component Cclass="CMSIS Driver" Cgroup="SAI" Csub="I2S" Capiversion="1.0" Cversion="1.2" condition="LPC1800 CMSIS SCU GPDMA">
      <description>SAI (I2S) Driver for LPC1800 Series</description>
      <RTE_Components_h>  <!-- the following content goes into file 'RTE_Components.h' -->
        #define RTE_Drivers_SAI0                /* Driver SAI0 */
        #define RTE_Drivers_SAI1                /* Driver SAI1 */
      </RTE_Components_h>
      <files>
        <file category="source" name="RTE_Driver/I2S_LPC18xx.c"/>
      </files>
    </component>

    <!-- MCB1800 Development Board -->
    <bundle Cbundle="MCB1800" Cclass="Board Support" Cversion="1.0.0">
      <description>Keil Development Board MCB1800</description>
      <doc>Documents/mcb1800.chm</doc>
      <component Cgroup="A/D Converter" condition="LPC1800 CMSIS SCU">
        <description>A/D Converter interface for Keil MCB1800 Development Board</description>
        <files>
          <file category="source" name="Boards/Keil/MCB1800/Common/ADC_MCB1800.c"/>
        </files>
      </component>
      <component Cgroup="LED" condition="LPC1800 CMSIS SCU GPIO">
        <description>LED interface for Keil MCB1800 Development Board</description>
        <files>
          <file category="source" name="Boards/Keil/MCB1800/Common/LED_MCB1800.c"/>
        </files>
      </component>
      <component Cgroup="Buttons" condition="LPC1800 CMSIS SCU GPIO">
        <description>Buttons interface for Keil MCB1800 Development Board</description>
        <files>
          <file category="source" name="Boards/Keil/MCB1800/Common/Buttons_MCB1800.c"/>
        </files>
      </component>
      <component Cgroup="Joystick" condition="LPC1800 CMSIS SCU GPIO">
        <description>Joystick interface for Keil MCB1800 Development Board</description>
        <files>
          <file category="source" name="Boards/Keil/MCB1800/Common/Joystick_MCB1800.c"/>
        </files>
      </component>
      <component Cgroup="Graphic LCD" condition="LPC1800 CMSIS SCU GPIO SPI">
        <description>Graphic LCD interface for Keil MCB1800 Development Board</description>
        <files>
          <file category="header" name="Boards/Keil/MCB1800/Common/GLCD_Config.h"/>
          <file category="source" name="Boards/Keil/MCB1800/Common/GLCD_Fonts.c"/>
          <file category="source" name="Boards/Keil/MCB1800/Common/GLCD_MCB1800.c"/>
        </files>
      </component>
      <component Cgroup="emWin LCD" Cvariant="RGB IF" condition="LPC1800 CMSIS SCU GPIO SPI Display">
        <description>emWin LCD RGB Interface for Keil MCB1800 Development Board</description>
        <files>
          <file category="source" name="Boards/Keil/MCB1800/Common/LCD_X.c"/>
        </files>
      </component>
      <component Cgroup="Touchscreen" Csub="STMPE811" condition="LPC1800 CMSIS RTOS and I2C Driver">
        <description>Touchscreen interface for STMPE811</description>
        <files>
          <file category="header" name="Boards/Keil/MCB1800/Common/STMPE811.h"/>
          <file category="source" name="Boards/Keil/MCB1800/Common/Touch_STMPE811.c"/>
        </files>
      </component>
      <component Cgroup="Thermometer" Csub="LM75" condition="LPC1800 CMSIS I2C Driver">
        <description>Thermometer interface for LM75</description>
        <files>
          <file category="source" name="Boards/Keil/MCB1800/Common/Thermometer_LM75.c"/>
        </files>
      </component>
      <component Cgroup="EEPROM" Csub="24LC128" condition="LPC1800 CMSIS I2C Driver">
        <description>EEPROM interface for 24LC128</description>
        <files>
          <file category="source" name="Boards/Keil/MCB1800/Common/EEPROM_24LC128.c"/>
        </files>
      </component>
      <component Cgroup="Audio" condition="LPC1800 CMSIS SCU GPIO SAI/I2C Driver">
        <description>Audio interface for UDA1380</description>
        <files>
          <file category="source" name="Boards/Keil/MCB1800/Common/Audio_UDA1380.c"/>
        </files>
      </component>
    </bundle>
  </components>
</package>
